---
kind: property
id: P:Autodesk.Revit.DB.PointOnPlane.XVec
source: html/74834354-a59c-1030-588c-003bf8477fc1.htm
---
# Autodesk.Revit.DB.PointOnPlane.XVec Property

The X-coordinate vector of the point, in the
plane's coordinate system.

## Syntax (C#)
```csharp
public UV XVec { get; set; }
```